Name - Ankit
Roll No.-19MTS5630
Class-BSc Mathematical Science 2nd year(3rd sem)
Date-07 Sept 2020

In [ ]:
import pandas as pd
from pandas import Series, DataFrame

In [ ]:
import numpy as np

1. Create a series of size 20 with random elements in any range and perform the following operations

In [ ]:
series=pd.Series(np.arange(20))
series

0      0
1      1
2      2
3      3
4      4
5      5
6      6
7      7
8      8
9      9
10    10
11    11
12    12
13    13
14    14
15    15
16    16
17    17
18    18
19    19
dtype: int64

(a) Change the index from 'a' to 't'

In [ ]:
series.index=['a','b','c','d','e','f','g','h','i','j','k','l','m','n','o','p','q','r','s','t']
series

a     0
b     1
c     2
d     3
e     4
f     5
g     6
h     7
i     8
j     9
k    10
l    11
m    12
n    13
o    14
p    15
q    16
r    17
s    18
t    19
dtype: int64

(b) Assign the values of 4th and 5th element of the series at 'm' and 'n' index position

In [ ]:
series['m','n']=[3,4]
series

a     0
b     1
c     2
d     3
e     4
f     5
g     6
h     7
i     8
j     9
k    10
l    11
m     3
n     4
o    14
p    15
q    16
r    10
s    10
t    10
dtype: int64

(c) Assign 10 value to the last 3 elements of the series

In [ ]:
series[17:]=10
series

a     0
b     1
c     2
d     3
e     4
f     5
g     6
h     7
i     8
j     9
k    10
l    11
m    12
n    13
o    14
p    15
q    16
r    10
s    10
t    10
dtype: int64

(d) Display the series values from index 'e' to 'r'

In [ ]:
series['e':'r']

e     4
f     5
g     6
h     7
i     8
j     9
k    10
l    11
m    12
n    13
o    14
p    15
q    16
r    10
dtype: int64

(e) Using loc function, display first 10 elements of series

In [ ]:
series.loc[:'j']

a    0
b    1
c    2
d    3
e    4
f    5
g    6
h    7
i    8
j    9
dtype: int64

(f) Using iloc function, display last 10 elements of series

In [ ]:
series.iloc[10:]

k    10
l    11
m    12
n    13
o    14
p    15
q    16
r    10
s    10
t    10
dtype: int64

(g) Sort the values of the series

In [ ]:
series.sort_values()

a     0
b     1
c     2
d     3
e     4
f     5
g     6
h     7
i     8
j     9
k    10
r    10
s    10
t    10
l    11
m    12
n    13
o    14
p    15
q    16
dtype: int64

2. Create two dataframes - First having 4 rows and 4 columns and Second with 3 rows and 4 columns, with random data values of your choice, and perform following operations

In [ ]:
df1 = pd.DataFrame(np.random.randn(4, 4), columns=['d','a','c','b'])
df1

          d         a         c         b
0 -0.336614  1.020264  0.247439  0.817070
1 -0.770172  0.854277 -1.583654  0.181994
2  1.045017 -0.008853  1.615692  1.110510
3  0.604278 -1.729748  0.620739 -0.192867

In [ ]:
df2 = pd.DataFrame(np.random.randn(4, 4), columns=[ 'c', 'b','d', 'a'])
df2

          c         b         d         a
0 -0.270190 -1.038231  1.107881  0.584540
1  1.080931 -0.212864 -1.301556 -1.400217
2 -1.414878 -1.678289  0.463366 -1.857638
3 -0.562129 -0.765117 -1.301853  0.231399

(a) Perform additions of the two dataframes

In [ ]:
df1+df2

          a         b         c         d
0  1.604804 -0.221161 -0.022751  0.771267
1 -0.545940 -0.030870 -0.502723 -2.071728
2 -1.866491 -0.567779  0.200814  1.508383
3 -1.498349 -0.957984  0.058609 -0.697575

(b) Perform difference of the two dataframes

In [ ]:
df1-df2

          a         b         c         d
0  0.435724  1.855301  0.517629 -1.444495
1  2.254494  0.394858 -2.664585  0.531384
2  1.848785  2.788798  3.030570  0.581650
3 -1.961147  0.572250  1.182868  1.906131

(c) Change the diagonal values in the first dataframe to NaN and then perform addition and substraction of the two dataframes

In [ ]:
df1.loc[0, 'a']= np.nan
df1.loc[1, 'b']= np.nan
df1.loc[2, 'c']= np.nan
df1.loc[3, 'd']= np.nan
df1

          d         a         c         b
0 -0.336614       NaN  0.247439  0.817070
1 -0.770172  0.854277 -1.583654       NaN
2  1.045017 -0.008853       NaN  1.110510
3       NaN -1.729748  0.620739 -0.192867

In [ ]:
#additon
df1+df2

          a         b         c         d
0       NaN -0.221161 -0.022751  0.771267
1 -0.545940       NaN -0.502723 -2.071728
2 -1.866491 -0.567779       NaN  1.508383
3 -1.498349 -0.957984  0.058609       NaN

In [ ]:
#subtraction
df1-df2

          a         b         c         d
0       NaN  1.855301  0.517629 -1.444495
1  2.254494       NaN -2.664585  0.531384
2  1.848785  2.788798       NaN  0.581650
3 -1.961147  0.572250  1.182868       NaN

(d) While adding the two dataframes, fill 100 in place of Nan values.

In [ ]:
df1.add(df2,fill_value=100)

            a          b          c          d
0  100.584540  -0.221161  -0.022751   0.771267
1   -0.545940  99.787136  -0.502723  -2.071728
2   -1.866491  -0.567779  98.585122   1.508383
3   -1.498349  -0.957984   0.058609  98.698147

(e) Perform Division of two dataframes

In [ ]:
df1.rdiv(df2,fill_value=1)

            a         b         c         d
0    0.584540 -1.270675 -1.091946 -3.291252
1   -1.639067 -0.212864 -0.682555  1.689955
2  209.834922 -1.511278 -1.414878  0.443406
3   -0.133776  3.967077 -0.905581 -1.301853

(f) Write a function to print difference between highest and lowest values of each column of both the dataframes

In [ ]:
cfunction = lambda x: x.max() - x.min()
df1.apply(cfunction)

d    1.815188
a    2.584025
c    2.204393
b    1.303376
dtype: float64

In [ ]:
#data frame 2
df2.apply(cfunction)

c    2.495809
b    1.465424
d    2.409734
a    2.442178
dtype: float64

(g) Write a function to print difference between highest and lowest values of each row of both the dataframes

In [ ]:
rfunction = lambda x: x.max() - x.min()
df1.apply(rfunction,axis='columns')

0    1.153684
1    2.437931
2    1.119362
3    2.350487
dtype: float64

In [ ]:
#data frame 2
df2.apply(rfunction,axis='columns')

0    1.323301
1    0.342514
2    1.707541
3    0.988256
dtype: float64

(h) Sort the index of both the dataframes columnwise and row-wise

In [ ]:
#row wise 
df1.sort_index()

          d         a         c         b
0 -0.336614       NaN  0.247439  0.817070
1 -0.770172  0.854277 -1.583654       NaN
2  1.045017 -0.008853       NaN  1.110510
3       NaN -1.729748  0.620739 -0.192867

In [ ]:
#data frame 2
df2.sort_index()

          c         b         d         a
0 -0.270190 -1.038231  1.107881  0.584540
1  1.080931 -0.212864 -1.301556 -1.400217
2 -1.414878 -1.678289  0.463366 -1.857638
3 -0.562129 -0.765117 -1.301853  0.231399

In [ ]:
# column wise
df1.sort_index(axis=1)

          a         b         c         d
0       NaN  0.817070  0.247439 -0.336614
1  0.854277       NaN -1.583654 -0.770172
2 -0.008853  1.110510       NaN  1.045017
3 -1.729748 -0.192867  0.620739       NaN

In [ ]:
#data frame 2
df1.sort_index(axis=1)

          a         b         c         d
0       NaN  0.817070  0.247439 -0.336614
1  0.854277       NaN -1.583654 -0.770172
2 -0.008853  1.110510       NaN  1.045017
3 -1.729748 -0.192867  0.620739       NaN

(i) Sort the values of both the dataframes column-wise and row-wise

In [ ]:
#column wise
df1.sort_values(by=['a'])

          d         c         b         a
0 -0.336614  0.247439  0.817070       NaN
1 -0.770172 -1.583654       NaN  0.854277
2  1.045017       NaN  1.110510 -0.008853
3       NaN  0.620739 -0.192867 -1.729748

In [ ]:
df1.sort_values(by=['b'])

          d         a         c         b
3       NaN -1.729748  0.620739 -0.192867
0 -0.336614       NaN  0.247439  0.817070
2  1.045017 -0.008853       NaN  1.110510
1 -0.770172  0.854277 -1.583654       NaN

In [ ]:
df1.sort_values(by=['c'])

          d         a         c         b
1 -0.770172  0.854277 -1.583654       NaN
0 -0.336614       NaN  0.247439  0.817070
3       NaN -1.729748  0.620739 -0.192867
2  1.045017 -0.008853       NaN  1.110510

In [ ]:
df1.sort_values(by=['d'])

          d         a         c         b
1 -0.770172  0.854277 -1.583654       NaN
0 -0.336614       NaN  0.247439  0.817070
2  1.045017 -0.008853       NaN  1.110510
3       NaN -1.729748  0.620739 -0.192867

In [ ]:
#data frame 2 
df2.sort_values(by=['a'])

          c         b         d         a
2 -1.414878 -1.678289  0.463366 -1.857638
1  1.080931 -0.212864 -1.301556 -1.400217
3 -0.562129 -0.765117 -1.301853  0.231399
0 -0.270190 -1.038231  1.107881  0.584540

In [ ]:
df2.sort_values(by=['b'])

          c         b         d         a
2 -1.414878 -1.678289  0.463366 -1.857638
0 -0.270190 -1.038231  1.107881  0.584540
3 -0.562129 -0.765117 -1.301853  0.231399
1  1.080931 -0.212864 -1.301556 -1.400217

In [ ]:
df2.sort_values(by=['c'])

          c         b         d         a
2 -1.414878 -1.678289  0.463366 -1.857638
3 -0.562129 -0.765117 -1.301853  0.231399
0 -0.270190 -1.038231  1.107881  0.584540
1  1.080931 -0.212864 -1.301556 -1.400217

In [ ]:
df2.sort_values(by=['d'])

          c         b         d         a
3 -0.562129 -0.765117 -1.301853  0.231399
1  1.080931 -0.212864 -1.301556 -1.400217
2 -1.414878 -1.678289  0.463366 -1.857638
0 -0.270190 -1.038231  1.107881  0.584540

In [ ]:
#row wise
df1.sort_values(by=[0],axis=1)

          d         c         b         a
0 -0.336614  0.247439  0.817070       NaN
1 -0.770172 -1.583654       NaN  0.854277
2  1.045017       NaN  1.110510 -0.008853
3       NaN  0.620739 -0.192867 -1.729748

In [ ]:
df1.sort_values(by=[1],axis=1)

          c         d         a         b
0  0.247439 -0.336614       NaN  0.817070
1 -1.583654 -0.770172  0.854277       NaN
2       NaN  1.045017 -0.008853  1.110510
3  0.620739       NaN -1.729748 -0.192867

In [ ]:
df1.sort_values(by=[2],axis=1)

          a         d         b         c
0       NaN -0.336614  0.817070  0.247439
1  0.854277 -0.770172       NaN -1.583654
2 -0.008853  1.045017  1.110510       NaN
3 -1.729748       NaN -0.192867  0.620739

In [ ]:
df1.sort_values(by=[3],axis=1)

          a         b         c         d
0       NaN  0.817070  0.247439 -0.336614
1  0.854277       NaN -1.583654 -0.770172
2 -0.008853  1.110510       NaN  1.045017
3 -1.729748 -0.192867  0.620739       NaN

In [ ]:
#data frame 2
df2.sort_values(by=[0],axis=1)

          b         c         a         d
0 -1.038231 -0.270190  0.584540  1.107881
1 -0.212864  1.080931 -1.400217 -1.301556
2 -1.678289 -1.414878 -1.857638  0.463366
3 -0.765117 -0.562129  0.231399 -1.301853

In [ ]:
df2.sort_values(by=[1],axis=1)

          a         d         b         c
0  0.584540  1.107881 -1.038231 -0.270190
1 -1.400217 -1.301556 -0.212864  1.080931
2 -1.857638  0.463366 -1.678289 -1.414878
3  0.231399 -1.301853 -0.765117 -0.562129

In [ ]:
df2.sort_values(by=[2],axis=1)

          a         b         c         d
0  0.584540 -1.038231 -0.270190  1.107881
1 -1.400217 -0.212864  1.080931 -1.301556
2 -1.857638 -1.678289 -1.414878  0.463366
3  0.231399 -0.765117 -0.562129 -1.301853

In [ ]:
df2.sort_values(by=[3],axis=1)

          d         b         c         a
0  1.107881 -1.038231 -0.270190  0.584540
1 -1.301556 -0.212864  1.080931 -1.400217
2  0.463366 -1.678289 -1.414878 -1.857638
3 -1.301853 -0.765117 -0.562129  0.231399

(j) Find the rank of elements in 2nd column of both the dataframes

In [ ]:
df1['b'].rank()

0    1.0
1    NaN
2    2.0
3    3.0
Name: b, dtype: float64

In [ ]:
df2['b'].rank()

0    4.0
1    2.0
2    1.0
3    3.0
Name: b, dtype: float64